DataProcessors/НастройкаДействий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>НастройкаДействий</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/НастройкиПроекта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НастройкиПроекта</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИмяНастройки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерНастройки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ДанныеКомплекта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДанныеКомплекта</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяДатаНачалоМонтажа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяДатаНачалоПроектирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяДатаНачалоПроизводства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяДатаНачалоРКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяДатаНачалоСогласования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяДатаНачалоТЗ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяДатаОкончаниеМонтажа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяДатаОкончаниеПроектирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяДатаОкончаниеПроизводства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяДатаОкончаниеРКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяДатаОкончаниеСогласования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяДатаОкончаниеТЗ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяПродолжительностьПроизводства</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоСогласований</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Конструктор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Приоритеты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекущаяСтадия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтадииКомплекта</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекущаяСтадияПроизводства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтадииКомплекта</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Комплект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Композиции</v8:Type>
						<v8:Type>cfg:CatalogRef.ИзделияКомплект</v8:Type>
						<v8:Type>cfg:CatalogRef.ГабаритныеЧертежи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ТаймингЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ТаймингЗадач</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаВремени</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СбросСчетчика</Name>
					<Comment>0 не изменяет,, 1 доработка, 2 корректировка, 4 изменение,</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияЗадач</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗадач</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипЗадачи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЗадачКонструирования</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УвеличениеСчетчика</Name>
					<Comment>0 не изменяет,, 1 доработка, 2 корректировка, 4 изменение</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:TypeSet>cfg:TaskRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/НастройкаДействий/Ext/ManagerModule.bsl
Функция ИзменитьСчетчикСобытий(Задача, НаименованиеДействия, ТипДействия) Экспорт

	МассивДействий = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиПроекта.НомерНастройки КАК НомерНастройки
		|ИЗ
		|	РегистрСведений.НастройкиПроекта КАК НастройкиПроекта
		|ГДЕ
		|	НастройкиПроекта.ИмяНастройки = &ИмяНастройки
		|	И НастройкиПроекта.Значение = ИСТИНА
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ДанныеКомплектаСрезПоследних.КоличествоСогласований, 0) КАК КоличествоСогласований,
		|	Задачи_ПКД.ОбъектТЗ КАК ОбъектТЗ
		|ИЗ
		|	Задача.Задачи_ПКД КАК Задачи_ПКД
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеКомплекта.СрезПоследних КАК ДанныеКомплектаСрезПоследних
		|		ПО Задачи_ПКД.ОбъектТЗ = ДанныеКомплектаСрезПоследних.Комплект
		|ГДЕ
		|	Задачи_ПКД.Ссылка = &Задача";
	
	Запрос.УстановитьПараметр("ИмяНастройки", СоответствиеДейстий(НаименованиеДействия, ТипДействия, МассивДействий));
	Запрос.УстановитьПараметр("Задача", Задача);
	
	Результат = Запрос.ВыполнитьПакет();
		
	КоличествоСогласований = 0;
	Выборка = Результат[1].Выбрать();
	Пока Выборка.Следующий() Цикл
		КоличествоСогласований 	= Выборка.КоличествоСогласований;
		ОтборКомплект = Новый Структура("Комплект", Выборка.ОбъектТЗ);
	КонецЦикла;
	
	ОтборЗадача = Новый Структура("Задача", Задача);
	Выборка = Результат[0].Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ИзменитьСчетчик(ОтборЗадача, ОтборКомплект, МассивДействий[Выборка.НомерНастройки - 1], КоличествоСогласований);
	КонецЦикла;
	
КонецФункции // ИзменитьСчетчикСобытий()

Функция ИзменитьСчетчик(ОтборЗадача, ОтборКомплект, НаименованиеДействия, КоличествоСогласований)
	
	Возврат 0;
	
	Если НаименованиеДействия = "Согласование" Тогда
		НовоеКоличествоСогласований = КоличествоСогласований + 1;
		РегистрыСведений.ДанныеКомплекта.ИзменитьДанныеКомплекта(Новый Структура("Комплект, КоличествоСогласований", ОтборКомплект.Комплект, НовоеКоличествоСогласований));
		Возврат НовоеКоличествоСогласований;
	КонецЕсли;
	
	МенеджерРегистра = РегистрыСведений.ТаймингЗадач;
	стДанные = МенеджерРегистра.ПолучитьСтруктуруДанных();
	
	Если НаименованиеДействия = "Номер ПКД согласованное" И КоличествоСогласований > 0 Тогда	
		
		ДанныеКомплекта = МенеджерРегистра.ПолучитьПоследнее(, ОтборЗадача);
		МенеджерРегистра.ЗаписатьНомераЗадачи(ОтборЗадача.Задача, ДанныеКомплекта.НомерПКД + 1);
		
		омЗадачиОбщие.ИзменитьНаименованиеЗадачи(ОтборЗадача.Задача);
		
	ИначеЕсли НаименованиеДействия = "Номер ПКД не согласованное" Тогда	

		ДанныеКомплекта = МенеджерРегистра.ПолучитьПоследнее(, ОтборЗадача);
		МенеджерРегистра.ЗаписатьНомераЗадачи(ОтборЗадача.Задача, ДанныеКомплекта.НомерПКД + 1);	
		
		омЗадачиОбщие.ИзменитьНаименованиеЗадачи(ОтборЗадача.Задача);
		
	ИначеЕсли НаименованиеДействия = "Доработка" Тогда	
		
		МенеджерРегистра.УстановитьСостояниеИсполнительЗадачи(ОтборЗадача.Задача, стДанные);
		
	ИначеЕсли НаименованиеДействия = "Изменение" Тогда	
		
		стДанные.ПереходИзменения = Истина;
		МенеджерРегистра.УстановитьСостояниеИсполнительЗадачи(ОтборЗадача.Задача, стДанные);
		
	ИначеЕсли НаименованиеДействия = "Редакция" Тогда	
		
		стДанные.ПереходРедакция = Истина;
		МенеджерРегистра.УстановитьСостояниеИсполнительЗадачи(ОтборЗадача.Задача, стДанные);
		
	ИначеЕсли НаименованиеДействия = "Рекламация" Тогда	
		
		стДанные.ПереходРекламация = Истина;
		МенеджерРегистра.УстановитьСостояниеИсполнительЗадачи(ОтборЗадача.Задача, стДанные);
		
	КонецЕсли;
	

КонецФункции

Функция СоответствиеДейстий(НаименованиеДействия, ТипДействия, МассивДействий)

	Если ТипДействия = "ПКД" Тогда
		МассивДействий = омЗадачиОбщие.КолонкиТаблицаКнопокПКД(); 
		Возврат	СоответствиеДейстийПКД(НаименованиеДействия);
	ИначеЕсли ТипДействия = "РКД" Тогда
		МассивДействий = омЗадачиОбщие.КолонкиТаблицаКнопокРКД(); 
		Возврат	СоответствиеДейстийРКД(НаименованиеДействия);
	ИначеЕсли ТипДействия = "Состояние" Тогда
		МассивДействий = омЗадачиОбщие.КолонкиТаблицаКнопокСостояние(); 
		Возврат	СоответствиеДейстийСостояние(НаименованиеДействия);
	КонецЕсли;	

КонецФункции // СоответствиеДейстий()

Функция СоответствиеДейстийПКД(НаименованиеДействия)

	НаименованиеКонопок = омЗадачиОбщие.ПолучитьНаименованиеПКД();
	
	Если НаименованиеДействия = "СбросКонструктором" Тогда
		Возврат НаименованиеКонопок[12];		
	ИначеЕсли НаименованиеДействия = "НачатьВыполнение" Тогда
		Возврат НаименованиеКонопок[9];
	ИначеЕсли НаименованиеДействия = "Приостановить" Тогда
		Возврат НаименованиеКонопок[11];
	ИначеЕсли НаименованиеДействия = "ЗавершениеРаботы" Тогда
		Возврат НаименованиеКонопок[10];
	ИначеЕсли НаименованиеДействия = "ДоработкаВедущийКонструктор" Тогда
		Возврат НаименованиеКонопок[13];
	ИначеЕсли НаименованиеДействия = "КонтрольВедущийКонструктор" Тогда
		Возврат НаименованиеКонопок[14];
	ИначеЕсли НаименованиеДействия = "ДоработкаДизайнера" Тогда
		Возврат НаименованиеКонопок[0];
	ИначеЕсли НаименованиеДействия = "КорректировкаДизайнер" Тогда
		Возврат НаименованиеКонопок[1];
	ИначеЕсли НаименованиеДействия = "КонтрольКП" Тогда
		Возврат НаименованиеКонопок[5];
	ИначеЕсли НаименованиеДействия = "Согласовано" Тогда
		Возврат НаименованиеКонопок[4];
	ИначеЕсли НаименованиеДействия = "ВозвратСЗапроса" Тогда
		Возврат НаименованиеКонопок[7];
	ИначеЕсли НаименованиеДействия = "ВозвратССогласования" Тогда
		Возврат НаименованиеКонопок[6];
	ИначеЕсли НаименованиеДействия = "ОтменаИзделия" Тогда
		Возврат НаименованиеКонопок[17];
	ИначеЕсли НаименованиеДействия = "СогласованоБезИзменений" Тогда
		Возврат НаименованиеКонопок[16];
	ИначеЕсли НаименованиеДействия = "СогласованоСИзменением" Тогда
		Возврат НаименованиеКонопок[15];
	КонецЕсли;
	
	Возврат "";    

КонецФункции // СоответствиеДейстийПКД(НаименованиеДействия)

Функция СоответствиеДейстийРКД(НаименованиеДействия)

	НаименованиеКонопок = омЗадачиОбщие.ПолучитьНаименованиеРКД();

	Если НаименованиеДействия = "НачатьВыполнение" Тогда
		Возврат НаименованиеКонопок[0];		
	ИначеЕсли НаименованиеДействия = "СбросДизайнеромКорректировкаДизайнера" Тогда
		Возврат НаименованиеКонопок[6];
	ИначеЕсли НаименованиеДействия = "СбросДизайнеромИзменениеЗаказчиком" Тогда
		Возврат НаименованиеКонопок[7];
	ИначеЕсли НаименованиеДействия = "СбросКонструктором" Тогда
		Возврат НаименованиеКонопок[3];
	ИначеЕсли НаименованиеДействия = "Приостановить" Тогда
		Возврат НаименованиеКонопок[2];
	ИначеЕсли НаименованиеДействия = "ЗавершениеРаботы" Тогда
		Возврат НаименованиеКонопок[1];
	ИначеЕсли НаименованиеДействия = "ДоработкаВедущийКонструктор" Тогда
		Возврат НаименованиеКонопок[4];
	ИначеЕсли НаименованиеДействия = "ОжиданиеСогласования" Тогда
		//Возврат НаименованиеКонопок[1];
	ИначеЕсли НаименованиеДействия = "Утверждение" Тогда
		Возврат НаименованиеКонопок[5];
	ИначеЕсли НаименованиеДействия = "ОжиданиеГЧ" Тогда
		Возврат НаименованиеКонопок[8];
	КонецЕсли;
	
	Возврат "";    

КонецФункции // СоответствиеДейстийПКД(НаименованиеДействия)

Функция СоответствиеДейстийСостояние(НаименованиеДействия)

	НаименованиеКонопок = омЗадачиОбщие.ПолучитьНаименованиеСостояний();

	Если НаименованиеДействия = "СтопНачало" Тогда
		Возврат НаименованиеКонопок[0];		
	ИначеЕсли НаименованиеДействия = "СтопОстановка" Тогда
		Возврат НаименованиеКонопок[1];
	ИначеЕсли НаименованиеДействия = "РекламацияНачало" Тогда
		Возврат НаименованиеКонопок[2];
	ИначеЕсли НаименованиеДействия = "РекламацияОстановка" Тогда
		Возврат НаименованиеКонопок[3];
	КонецЕсли;

КонецФункции // СоответствиеДейстийПКД(НаименованиеДействия)
